# Special (magic) methods __method_name__


class Person:
    def __init__(self, first_name, last_name, age):
        self.first_name = first_name
        self.last_name = last_name
        self.age = age

    def __str__(self):
        return self.first_name + ' ' + self.last_name

    def __len__(self):
        return self.age

    def __add__(self, other):
        return self.age + other.age

    def __del__(self):
        print('Person object with name ' + self.first_name + ' is deleted'
                                                             ' from memory')


jack = Person('Jack', 'White', 45)
jane = Person('Jane', 'Eyre', 23)

print(jack + jane)

print([1, 2, 3, 4, 5])
print(jack)
print(len(jack))
# del (jack)
# print(jack)
#
# x = 5
# y = 3
#
# a = '5'
# b = '3'
#
# print(x.__add__(y))
# print(a.__add__(b))

# HOMEWORK
'''Создайте класс Chain с атрибутом number_of_items. Создайте два специальных метода в этом классе. Первый должен при 
вызове встроенной функции print() для объекта этого класса выводить 'Chain with (значение number_of_items) items'
Второй должен при вызове встроенной функции len() для объекта этого класса возвращать значение number_of_items этого 
объекта'''
class Chain():
    def __init__(self, number_of_items):
        self.number_of_items = number_of_items

    def __str__(self):
        return f'Chain with {self.number_of_items} items'

    def __len__(self):
        return self.number_of_items

chain = Chain(5)
print(chain)
print(len(chain))