# Выведите на экран результат произведения чисел 3 и 7
print(3 * 7)

# Выведите на экран результат возведения числа 4 в степень 3
print(4 ** 3)

# Выведите на экран результат вычисления остатка от деления числа 29 на 5
print(29 % 5)

print(34 // 7)
print(16 - 9)
print(25 * 5)
print(11 + 5)
print((16 + 4) // 6)