# print(1 < 2)
# print(type(True))
# print(type(False))
#
# # Comparison operators
#
# print(1 == 1)
# print(1 == 2)
# print('Hello' == 'Hello')
# print('Hello' == 'hello')

# print(1 != 1)
# print(1 != 2)
# print('Hello' != 'Hello')
# print('Hello' != 'hello')

# print(1 > 2)
# print(1 < 2)
# print(2 >= 2)
# print(3 >= 2)
# print(2 <= 2)
# print(3 <= 2)
#
# print(ord('a'))
# print(ord('b'))
# print('a' > 'b')
# print('hi' > 'hello')
# print(ord('i'))
# print(ord('e'))

# x = 10
# y = 23
#
# print(x > y)
# print(x < y)
# print(x == y)
# print(x != y)

# age = int(input('Input your age: '))
# print('Access is permitted: ' + str(age >= 18))

# HOMEWORK
'''Вопросы к этому заданию
1. Создайте 2 переменных, содержащие числовые значения. Сравните их при помощи всех операторов сравнения и выведите 
результат на экран

2. Сравните две одинаковых буквы, но одна из них должна быть заглавной, при помощи операторов сравнения ">" и выведите 
результат на экран. Выведите на экран ASCII код каждой из букв'''
a = 5
b = 7
print(a == b)
print(a != b)
print(a > b)
print(a < b)
print(a >= b)
print(a <= b)

a = 'A'
b = 'a'
print(a == b)
print(a != b)
print(a > b)
print(a < b)
print(a >= b)
print(a <= b)
print(ord(a))
print(ord(b))