x = 5
print(x)
x = 'Hello!'
print(x)
x = 7.9
type_var = type(x)
print(type_var)

car_color = "black"

x = 7
y = 2
print(x + y)
print(x - y)
print(x * y)
print(x / y)
print(x ** y)
print(x // y)
print(x % y)

credit = 1000
credit_rate = 10
number_of_years = 5
final_sum = credit + credit / 100 * credit_rate * number_of_years
print(final_sum)

# homework
'''1. Создайте переменные, описывающие автомобиль - модель, цвет, год, количество дверей. Поместите в них значения. 
Затем поменяйте цвет автомобиля, присвоив ниже в коде новое значение соответствующей переменной. Выведите на экран все 
значения.  При создании имён переменных используйте подходящие по смыслу слова. Воспользуйтесь Google переводчиком, 
если нужно.'''
car_model = "BMW"
car_color = "yellow"
car_year = 2014
car_number_of_doors = 4
car_color = "black"
print(car_model)
print(car_color)
print(car_year)
print(car_number_of_doors)

'''2. Создайте переменные, в которые будете помещать возраст людей. Также создайте переменную, в которой будет храниться 
количество людей. Вычислите и выведите на экран средний возраст человека исходя из данных о возрасте этих пятерых людей. 
Если не знаете формулу вычисления среднего арифметического значения, воспользуйтесь поиском информации в интернете. При 
создании имён переменных используйте подходящие по смыслу слова. Воспользуйтесь Google переводчиком, если нужно.'''
people1 = 8
people2 = 75
people3 = 13
people4 = 39
people5 = 35
number_of_people = 5
average_ariphm = (people1 + people2 + people3 + people4 + people5) / number_of_people
print(average_ariphm)