# import greetings
#
# greetings.say_hello()

from greetings import say_hey_there
say_hey_there()

from goodbyes import say_good_bye as my_good_bye
my_good_bye()

# HOMEWORK
'''Создайте файл utils.py  и определите в нем 2 функции - get_favorite_color() и get_favorite_number(). Первая функция 
должна возвращать строку 'super-duper color', вторая должна возвращать число 13.
Создайте файл main_file.py и в нем 2 переменные - color и number. Присвойте значения этим переменным при помощи вызова 
функций get_favorite_color() и get_favorite_number(). Выведите значение переменных на экран'''
import utils

color = utils.get_favorite_color()
number = utils.get_favorite_number()

print(color)
print(number)